"**1K PU Foam Heat-Rise Simulator** is a professional web application for predicting temperature rise in one-component polyurethane foam systems. The platform features a multi-page architecture with Dashboard (simulation overview), New Simulation (formulation builder), Material Library (CRUD management), AI Property Lookup (intelligent material research), Reports (PDF generation), Settings (preferences), and Help (documentation). The core calculation engine implements exact thermodynamic equations: NCO moles calculation (n_NCO = mass_iso × NCO_content / 42), heat release (Q = n_NCO × ΔH_rxn), heat capacity (Cp_total = Σ(mass_i × Cp_i)), and temperature rise (ΔT = Q / Cp_total). The formulation builder supports Part A/B component management with real-time validation and calculation updates. AI-powered material property lookup provides confidence-scored predictions with source attribution using mock responses. The material library contains comprehensive data for polyols (PEGs, PPGs), catalysts (tertiary amines, organometallics), flame retardants (TCPP, TEP), and isocyanates (MDI, TDI) with full CRUD operations. PDF report generation includes calculation transparency with step-by-step equation display, material composition tables, and safety assessments. The safety risk assessment system uses color-coded badges (green: <30°C, yellow: 30-50°C, red: >50°C) for visual risk communication. Draft simulations persist via localStorage for session recovery. The UI features professional scientific styling with clean data tables, card-based layouts, glassmorphism effects, smooth animations, and dark mode support optimized for laboratory environments. State management uses Zustand for global simulation state, with React Hook Form for input validation. The tech stack includes React Router DOM for navigation, Tailwind CSS for styling, Framer Motion for animations, jsPDF and html2canvas for report generation, React Icons and Lucide React for iconography, and React Hot Toast for notifications.\\n\\n**Last changes:** Initial project setup with complete multi-page architecture, thermodynamic calculation engine implementation, AI property lookup system, material library with CRUD operations, PDF report generation, safety risk assessment, and draft persistence functionality."